package com.example;

public class Client {

    //快捷键 pvsm
    public static void main(String[] args) {
        //例子：你要别人买饭，钱是你掏
        Man man = new Man();
        Salesman salesman = new Salesman(man);
        //饭是别人买
        salesman.applyBank();

        String s = "轮回之须, 邪恶电弧, 十二獠牙之野猪斗篷, 崩裂之尾, 螺旋法杖, 皇家海军上将的双角帽, 脊柱之剑," +
                " 殇月国镌纹弯刀, 超维视界之盔, 瞬息鬼影之袖, 悠远金沙飞镖, 剑圣的护臂, 噩梦之烽, 暗黑虚空神杖, " +
                "瞬息鬼影之角, 先祖英魂腰带, 暗黑死神护体, 奥法宗师的遗忘巨杖, 鱼人骑士之噬 - 副手, 寒铁雄风之盾, " +
                "混沌战驹, 无尽浩劫披肩, 游民护甲, 迫近罪孽肩铠, 迫近罪孽护腕, 绝顶恶鬼双袍, 焦热血统长袖, 狂暴面具, " +
                "猎兔能手披风, 翡翠之癫头盔, 绝顶恶鬼双翼, 暗黑死神束腰, 松绿腿甲, 血契斗篷, 刚硬守卫腿甲, 草原战尾," +
                " 草原战臂, 鱼人骑士之鳍, 沉默守卫之服, 腥月刺客的隐秘头饰, 翡翠之癫手套, 放逐浪人盔甲, 碎石王冠," +
                " 狂暴护腕, 放逐浪人重担, 白熊之灵, 风暴窃贼护腕, 寒冰泪滴臂甲, 北风行者护肩, 苦行僧头巾, " +
                "夜巡法师法杖, 老船长烟斗, 命运纠缠腮须, 白骨荒墟劫匪巾帕, 翡翠之癫护符, 斩敌巨刃, 冥魂领主斗篷, " +
                "沉默守卫之刃, 上将的藏钥处, 寒冰泪滴肩铠, 血染沙漠之刃, 天炼护腰, 刚硬守卫臂刃, 风暴窃贼之盔, " +
                "腐蚀之甲, 飞鸟金石法杖, 黑暗星辰, 血染沙漠尖枪, 深海守卫的充公头巾, 上将的掠夺之帽, 苦行僧之衣," +
                " 天南星之矛, 远古战甲护胸, 吉祥 炎纫面料护手和燃烧弹, 吉祥 夺命杀手装扮, 吉祥 流浪者胸衣," +
                " 血染沙漠飞镖, 名门愤怒, 秘奥护手, 赤色战神肩铠, 鬣蜥之弓, 操控之服, 铭刻 玉凰之舞, " +
                "失却群岛的疗伤之泉, 吉祥 呼啸狂狼护肩, 吉祥 无尽月蚀护盾, 吉祥 战魔护臂, 航海家黑靴, " +
                "编织大师手臂, 吉祥 赤兔, 吉祥 战魔护肩, 吉祥 名门重担, 吉祥 灵猫之弓, 吉祥 航海家的系扣衫, " +
                "神圣宝珠外壳, 幽暗之域长裙, 腥月刺客的隐秘护甲, 醉酒战将护肩, 骏马战盔, 吉祥 锁链护甲, " +
                "吉祥 白熊之腕, 吉祥 星辰之光护臂, 吉祥 鱼人骑士之盔, 北风行者斗篷, 神炼符文护腕, 风暴窃贼护甲, " +
                "屠神砧板, 纯正 描述标签, 纯正 名称变更, 石堂城皇家军战旗, 北极光长袍, 无尽月蚀战刃, " +
                "永恒之光腰带, 占卜师长裙, 热火公主马尾, 黑暗游侠头巾, 怨灵披风, 炎纫面料斗篷, 腥红渡鸦利爪," +
                " 青蕈领主的苔藓长须, 太古之皇镰刀, 腥红渡鸦头巾, 洞察之腿, 密令马尾, 迫近罪孽头盔, 狂暴之尾," +
                " 天南星之发, 司令护腰, 老屠手的晚餐使者, 鬼刃, 灵猫之爪, 半神巨剑, 吉祥 天罚碎片, 寒冰泪滴长矛," +
                " 腥红渡鸦大衣, 鬼面武者护腕, 神炼符文双翼, 铁帆手套, 占卜师腰带, 丰豚公主, 秘奥之视, 名门之棘, " +
                "狂风箭袋, 摧残之鞘, 重刺晨星, 灵猫腿罩, 三冰铸就头饰, 冥界领主腰带, 摧残之角, 福星鳞铠, " +
                "编织大师触角, 世行者的重型腰带, 堕落琥珀法杖, 战魔头盔, 天辉卫士印记, 新月披肩, 冥棘之剑, " +
                "呼啸狂狼之帽, 厉鬼之灵腰带, 近卫游侠护胫, 苦行僧护体, 飞鸟金石之盔, 无尽浩劫之盔, 名门愤怒 - 副手, " +
                "炼金术士灌注之刃, 秘奥之视, 魔岩坚腕, 月光骑士肩饰, 第二门徒护体, 腥红渡鸦手套, 地狱撕裂之刃, " +
                "无面时空领主战棍, 神炼符文腰带, 神驹特使护手, 迷雾梦魇兽, 沉默捍卫者之盔, 神龙军臂章, 沙漠之风肩甲," +
                " 觉醒之腕, 天南星之裙, 腐蚀之节, 阿森纳魔法师护肩, 恶魔之附, 厉鬼之灵护肩, 洞察之冠, 新月骑手护肩, " +
                "神圣飞升腰带, 现世之龙, 北极光头巾, 命运纠缠之冠, 苍天卫士短裙, 摧残之翼, 翠玉小龙, 深渊魔刃, " +
                "强酸之袭烧瓶, 司令衣领, 月光骑士护体, 红发鹤魂双翼, 厉鬼之灵发辫, 外域女巫腰带, 福星华帽, " +
                "龙皇格林炮, 冰羽霓裳护腕, 呼啸狂狼护腕, 厉鬼之灵巨刃, 侵扰之腿, 永世之治护臂, 魔岩护腰, " +
                "沙漠之风护手, 神龙军双旗, 冰元之注右臂, 外域女巫恶灵, 东方道骨之腕, 屠神面容, 迅捷魔童, " +
                "外域女巫裙角, 阿森纳魔法师护手, 侵扰之颅, 苍天卫士之弓, 永世之治王冠, 永世之治护肩, 近卫游侠手套," +
                " 深部岩浆巨角, 神圣飞升双翼, 强酸之袭护腕, 侵扰之卵, 苍天卫士护腕, 神驹特使战戟, 苍天卫士箭袋," +
                " 永世之治斗篷, 沉默捍卫者之袍, 新月骑手战盔, 永世之治冥剑, 医祀牧师法杖, 绞木魔杖, 裁决之剑, " +
                "冰原碎斧, 厉鬼之灵腰带, 魔咒焦翼, 东方道骨披风, 神驹特使战盔, 魔裔披风, 神圣飞升斗篷, " +
                "比洛特的高贵头盔, 血雾头盔, 血雾腰带, 血雾肩铠, 血雾弯斧, 古韵载入画面, 赤角羊, 苦行打铁小恶魔," +
                " 嘲讽：皇家之蔑, 2016年国际邀请赛鼠标指针, 2016年国际邀请赛雕像石, 2016年国际邀请赛音乐包, " +
                "2016年国际邀请赛界面皮肤, 克制之烙, 超然力丸载入画面, 超然酒仙载入画面, 超然水晶室女载入画面," +
                " 超然巨牙海民载入画面, 超然虚空假面载入画面, 播音员：水晶室女, 连杀配音：水晶室女, " +
                "超然熊战士载入画面, 超然复仇之魂载入画面, 超然伐木机载入画面, 超然幻影长矛手载入画面, " +
                "2016年国际邀请赛载入画面, 蝶翼之箭长靴, 蝶翼之箭长弓, 蝶翼之箭护腕, 蝶翼之箭披风, 蝶翼之箭护体, " +
                "蝶翼之箭面罩, 蝶翼之箭箭袋, 蝶翼之箭载入画面, 嘲讽：小刀翻转！, 精纯之鸦载入画面, 精纯之鸦双翼, " +
                "精纯之鸦羽带, 精纯之鸦神目, 精纯之鸦利爪, 精纯之鸦守卫, 精纯之鸦魔噬, 折翼之慕, 嘲讽：食人魔跃起, " +
                "泪水之冠, 2016年马尼拉特级锦标赛奖杯聊天表情, 乌瑞辛猎手长弓, 乌瑞辛猎手利爪, 乌瑞辛猎手护臂," +
                " 乌瑞辛猎手箭袋, 乌瑞辛猎手哨卫, 金玉之唤, 帝国圣物之冠, 铭刻 帝国圣物肩铠, 帝国圣物图腾, " +
                "帝国圣物护胫, 帝国圣物护臂, 帝国圣物载入画面, 幻影协律, 炎阳锻炉, 苍白之示, 谍影潜藏, 魔扉守卫护腕," +
                " 魔扉守卫腰带, 魔扉守卫斗篷, 魔扉守卫头巾, 魔扉守卫钥匙, 魔扉守卫法杖, 魔扉守卫肩铠, " +
                "魔扉守卫载入画面, 憎厌卫士, 布狗, 深海守卫的贝壳肩铠, 深海守卫的利齿护腕, 深海守卫的暗射线斗篷, " +
                "深海守卫的充公头巾, 深海守卫的珍贵弯刀, 碧磷, 北极光牡鹿, 欧贝里斯之翼坐骑";
        String[] split = s.split(",");
        System.out.println(split.length);
    }

}
